#include <windows.h>

#define BUFFER_SIZE 512

void WriteDataInFile(HANDLE hFile, char* buff)
{
	struct _OVERLAPPED overlapped;                                        //§µ§Ü§Ñ§Ù§Ñ§ä§Ö§Ý§î §ß§Ñ §ã§ä§â§å§Ü§ä§å§â§å overlapped
	overlapped.Offset = 0xFFFFFFFF;										  //§®§Ö§ã§ä§à§á§à§Ý§à§Ø§Ö§ß§Ú§Ö §æ§Ñ§Û§Ý§Ñ, §Ó §Ü§à§ä§à§â§à§Þ §ß§Ñ§é§Ú§ß§Ñ§Ö§ä§ã§ñ §á§Ö§â§Ö§Õ§Ñ§é§Ñ
	overlapped.OffsetHigh = 0xFFFFFFFF;									  //§³§ä§Ñ§â§ê§Ö§Ö §ã§Ý§à§Ó§à §á§à§Ù§Ú§è§Ú§Ú §æ§Ñ§Û§Ý§Ñ, §Ó §Ü§à§ä§à§â§í§Û §ß§Ñ§é§Ú§ß§Ñ§Ö§ä§ã§ñ §á§Ö§â§Ö§Õ§Ñ§é§Ñ
	overlapped.hEvent = NULL;											  //§¥§Ö§ã§Ü§â§Ú§á§ä§à§â §ã§à§Ò§í§ä§Ú§ñ, §Ü§à§ä§à§â§í§Ö §Õ§à§Ý§Ø§ß§à §Ò§í§ä§î §å§ã§ä§Ñ§ß§à§Ó§Ý§Ö§ß§à §Ó §ã§Ú§Ô§ß§Ñ§Ý§î§ß§à§Ö §ã§à§ã§ä§à§ñ§ß§Ú§Ö, §Ü§à§Ô§Õ§Ñ §à§á§Ö§â§Ñ§è§Ú§ñ §Ù§Ñ§Ó§Ö§â§ê§Ú§Ý§Ñ§ã§î
	DWORD cbWritten;												      //§¹§Ú§ã§Ý§à §Ù§Ñ§á§Ú§ã§Ñ§ß§ß§í§ç §Ò§Ñ§Û§ä										  
	WriteFile(hFile,                                                      //§¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ
		buff,														      //§¢§å§æ§Ö§â §Õ§Ñ§ß§ß§í§ç
		strlen(buff), 													  //§¹§Ú§ã§Ý§à §Ò§Ñ§Û§ä §Õ§Ý§ñ §Ù§Ñ§á§Ú§ã§Ú
		&cbWritten, 													  //§¹§Ú§ã§Ý§à §Ù§Ñ§á§Ú§ã§Ñ§ß§ß§í§ç §Ò§Ñ§Û§ä
		&overlapped);													  //§¡§ã§Ú§ß§ç§â§à§ß§ß§ß§í§Û §Ò§å§æ§Ö§â
	WaitForSingleObject(hFile, INFINITE);								  //§°§Ø§Ú§Õ§Ñ§ß§Ú§Ö §æ§Ñ§Û§Ý§à§Ó§à§Ô§à §Õ§Ö§ã§Ü§â§Ú§á§ä§à§â§Ñ
}

void ReadDataFromFile(HANDLE hFile, char* buff)
{
	memset(buff, 0, BUFFER_SIZE * sizeof(char));    //§£§í§Õ§Ö§Ý§Ö§ß§Ú§Ö §á§Ñ§Þ§ñ§ä§Ú §á§à§Õ §Ò§å§æ§Ö§â
	struct _OVERLAPPED overlapped;
	overlapped.Offset = 0; 							//§®§Ö§ã§ä§à§á§à§Ý§à§Ø§Ö§ß§Ú§Ö §æ§Ñ§Û§Ý§Ñ, §Ó §Ü§à§ä§à§â§à§Þ §ß§Ñ§é§Ú§ß§Ñ§Ö§ä§ã§ñ §á§Ö§â§Ö§Õ§Ñ§é§Ñ
	overlapped.OffsetHigh = 0;
	overlapped.hEvent = NULL;						
	DWORD cbRead;									//§¹§Ú§ã§Ý§à §á§â§à§é§Ú§ä§Ñ§ß§ß§í§ç §Ò§Ñ§Û§ä
	ReadFile(hFile, 								//§¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ
		buff,										//§¢§å§æ§Ö§â §Õ§Ñ§ß§ß§í§ç
		BUFFER_SIZE, 								//§¹§Ú§ã§Ý§à §Ò§Ñ§Û§ä §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ
		&cbRead, 									//§¹§Ú§ã§Ý§à §á§â§à§é§Ú§ä§Ñ§ß§ß§í§ç §Ò§Ñ§Û§ä
		&overlapped);								//§¡§ã§Ú§ß§ç§â§à§ß§ß§í§Û §Ò§å§æ§Ö§â
}